orchestrations/FeedReader/src/FeedReader.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="FeedReader" targetNamespace="http://modalis.i3s.unice.fr/jSeduite/orchestrations/wsdl/FeedReader"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://modalis.i3s.unice.fr/jSeduite/orchestrations/wsdl/FeedReader" xmlns:ns="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/FeedReader" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://modalis.i3s.unice.fr/jSeduite/orchestrations/wsdl/FeedReader">
            <xsd:import namespace="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/FeedReader" schemaLocation="FeedReader.xsd"/>
        </xsd:schema>
    </types>
    <message name="ReadAFeedRequest">
        <part name="in" element="ns:ReadAFeedRequest"/>
    </message>
    <message name="ReadAFeedResponse">
        <part name="out" element="ns:ReadAFeedResponse"/>
    </message>
    <portType name="FeedReaderPortType">
        <operation name="ReadAFeed">
            <input name="input1" message="tns:ReadAFeedRequest"/>
            <output name="output1" message="tns:ReadAFeedResponse"/>
        </operation>
    </portType>
    <binding name="FeedReaderBinding" type="tns:FeedReaderPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ReadAFeed">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="FeedReaderService">
        <port name="FeedReaderPort" binding="tns:FeedReaderBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/FeedReaderService/FeedReaderPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="FeedReader">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="FeedReaderPortTypeRole" portType="tns:FeedReaderPortType"/>
    </plnk:partnerLinkType>
</definitions>
