orchestrations/FeedReaderComponent/test/Invoker/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:feed="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/FeedReader">
  <soapenv:Body>
    <feed:ReadAFeedRequest>
      <feed:feedName>tele7</feed:feedName>
    </feed:ReadAFeedRequest>
  </soapenv:Body>
</soapenv:Envelope>